import {FC, memo} from "react";


// функція в FC при кожному перереджувані в пропсах є об'єкт і тому вона міняє посилання
// (тобто створює нову комірку) і тому здається, що memo не працює,
// але memo працює, тому що змінюються пропси
// для того, щоб це не відбувалося необхідно функцію fn в UsersComponent огорнути в useCallback,
//тоді useCallback буде зберігати посилання цієї функції і пропси в не змінюватимуться


// коли не слід використовувати
// якщо фукнція не передається в дочірні комроненти
// якщо проста
// якщо немає проблем з продуктивністю


const UserComponent:FC<{fn: () => void}> = memo(() => {
    console.log('user')
    return (
        <div>
            UserComponent
        </div>
    );
});

export default UserComponent;